# DeleteConstruction Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPSpaceConstruction..::..DeleteConstruction Method
MEPSpaceConstruction Class See Also
---
Remove an existing construction from Space constructions.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void DeleteConstruction(
	MEPBuildingConstruction pCurrentConstruction
)
```

Visual Basic
---
```text
Public Sub DeleteConstruction ( _
	pCurrentConstruction As MEPBuildingConstruction _
)
```

Visual C++
---
```text
public:
void DeleteConstruction(
	MEPBuildingConstruction^ pCurrentConstruction
)
```

# ### Parameters
pCurrentConstruction
    Type: Autodesk.Revit.DB.Mechanical..::..MEPBuildingConstructionThe Construction will be deleted.
# See Also
MEPSpaceConstruction Class
Autodesk.Revit.DB.Mechanical Namespace